HuynhPhuoc00/IoT_Prj/PRJ_001/Drivers/STM32/GPIO.h
/*
 * stm32f411_gpio_driver.h
 *
 *  Created on: Jul 5, 2023
 *      Author: HuynhPhuoc
 */

#ifndef INC_STM32F411_GPIO_DRIVER_H_
#define INC_STM32F411_GPIO_DRIVER_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "../../Drivers/STM32/stm32f411.h"

// GPIO base address
#define GPIOA_BASE_ADDR                  0x40020000U
#define GPIOB_BASE_ADDR                  0x40020400U
#define GPIOC_BASE_ADDR                  0x40020800U
#define GPIOD_BASE_ADDR                  0x40020C00U
#define GPIOE_BASE_ADDR                  0x40021000U

// GPIO Register
typedef struct
{
    vo uint32_t MODER  ;
    vo uint32_t OTYPER ;
    vo uint32_t OSPEEDR;
    vo uint32_t PUPDR  ;
    vo uint32_t IDR    ;
    vo uint32_t ODR    ;
    vo uint32_t BSRR   ;
    vo uint32_t LCKR   ;
    vo uint32_t AFRL   ;
    vo uint32_t AFRH   ;
}GPIO_RegDef_t;

//GPIO Type
typedef struct{
    uint16_t GPIO_PinNumber;
    uint8_t GPIO_PinMode;
    uint8_t GPIO_PinSpeed;
    uint8_t GPIO_PinPuPdControl;
    uint8_t GPIO_PinOPType;
    uint8_t GPIO_PinAltFunMode_High;
    uint8_t GPIO_PinAltFunMode_Low;

}GPIO_Pin_Config_t;

typedef struct GPIO_Handle_t{
    GPIO_RegDef_t     *pGPIOx;
    GPIO_Pin_Config_t GPIO_Pin_Config;
}GPIO_Handle_t;

// Peripheral definition
#define GPIOA   ((GPIO_RegDef_t*)GPIOA_BASE_ADDR)
#define GPIOB   ((GPIO_RegDef_t*)GPIOB_BASE_ADDR)
#define GPIOC   ((GPIO_RegDef_t*)GPIOC_BASE_ADDR)
#define GPIOD   ((GPIO_RegDef_t*)GPIOD_BASE_ADDR)
#define GPIOD   ((GPIO_RegDef_t*)GPIOD_BASE_ADDR)
#define GPIOE   ((GPIO_RegDef_t*)GPIOE_BASE_ADDR)

// GPIO pin number
#define GPIO_PIN_NUM_0		            0
#define GPIO_PIN_NUM_1		            1
#define GPIO_PIN_NUM_2		            2
#define GPIO_PIN_NUM_3		            3
#define GPIO_PIN_NUM_4		            4
#define GPIO_PIN_NUM_5		            5
#define GPIO_PIN_NUM_6		            6
#define GPIO_PIN_NUM_7		            7
#define GPIO_PIN_NUM_8		            8
#define GPIO_PIN_NUM_9		            9
#define GPIO_PIN_NUM_10		            10
#define GPIO_PIN_NUM_11		            11
#define GPIO_PIN_NUM_12		            12
#define GPIO_PIN_NUM_13		            13
#define GPIO_PIN_NUM_14		            14
#define GPIO_PIN_NUM_15		            15

#define PIN_NUM_0		          (1 << GPIO_PIN_NUM_0)
#define PIN_NUM_1		          (1 << GPIO_PIN_NUM_1)
#define PIN_NUM_2		          (1 << GPIO_PIN_NUM_2)
#define PIN_NUM_3		          (1 << GPIO_PIN_NUM_3)
#define PIN_NUM_4		          (1 << GPIO_PIN_NUM_4)
#define PIN_NUM_5		          (1 << GPIO_PIN_NUM_5)
#define PIN_NUM_6		          (1 << GPIO_PIN_NUM_6)
#define PIN_NUM_7		          (1 << GPIO_PIN_NUM_7)
#define PIN_NUM_8		          (1 << GPIO_PIN_NUM_8)
#define PIN_NUM_9		          (1 << GPIO_PIN_NUM_9)
#define PIN_NUM_10		          (1 << GPIO_PIN_NUM_10)
#define PIN_NUM_11		          (1 << GPIO_PIN_NUM_11)
#define PIN_NUM_12		          (1 << GPIO_PIN_NUM_12)
#define PIN_NUM_13		          (1 << GPIO_PIN_NUM_13)
#define PIN_NUM_14		          (1 << GPIO_PIN_NUM_14)
#define PIN_NUM_15		          (1 << GPIO_PIN_NUM_15)

// GPIO port mode register
#define GPIO_MODER_INPUT                0
#define GPIO_MODER_OUTPUT               1
#define GPIO_MODER_ALTFM                2
#define GPIO_MODER_ANALOG               3

// GPIO port output type register
#define  GPIO_OTYPER_PP                 0
#define  GPIO_OTYPER_OD                 1

// GPIO port output speed register
#define GPIO_OSPEEDR_LOW                0
#define GPIO_OSPEEDR_MEDIUM             1
#define GPIO_OSPEEDR_HIGH               2
#define GPIO_OSPEEDR_VERYHIGH           3

// GPIO port PUPD register
#define GPIO_PUPDR_NOPUPD               0
#define GPIO_PUPDR_PU                   1
#define GPIO_PUPDR_PD                   2
#define GPIO_PUPDR_RESERVED             3

//GPIO port ALT function
#define GPIO_AFRH_AF0               	0
#define GPIO_AFRH_AF1                   1
#define GPIO_AFRH_AF2                   2
#define GPIO_AFRH_AF3             		3
#define GPIO_AFRH_AF4             		4
// ...
#define GPIO_AFRH_AF15            		15

//GPIO port ALT function
#define GPIO_AFRL_AF0               	0
#define GPIO_AFRL_AF1                   1
#define GPIO_AFRL_AF2                   2
#define GPIO_AFRL_AF3             		3
#define GPIO_AFRL_AF4             		4
#define GPIO_AFRL_AF5             		5
// ...
#define GPIO_AFRL_AF7             		7
// ...
#define GPIO_AFRL_AF15            		15

// GPIO peripheral clock enable register
#define GPIOA_PCLK_EN           (RCC->AHB1ENR |= (1<<0))
#define GPIOB_PCLK_EN           (RCC->AHB1ENR |= (1<<1))
#define GPIOC_PCLK_EN           (RCC->AHB1ENR |= (1<<2))
#define GPIOD_PCLK_EN           (RCC->AHB1ENR |= (1<<3))
#define GPIOE_PCLK_EN           (RCC->AHB1ENR |= (1<<4))

// GPIO peripheral clock disable register
#define GPIOA_PCLK_DIS          (RCC->AHB1ENR &= ~(1<<0))
#define GPIOB_PCLK_DIS          (RCC->AHB1ENR &= ~(1<<1))
#define GPIOC_PCLK_DIS          (RCC->AHB1ENR &= ~(1<<2))
#define GPIOD_PCLK_DIS          (RCC->AHB1ENR &= ~(1<<3))
#define GPIOE_PCLK_DIS          (RCC->AHB1ENR &= ~(1<<4))

//Marco reset GPIOx peripheral
#define GPIOA_REG_RST()         do{RCC->AHB1RSTR |= (1<<0);RCC->AHB1RSTR &= ~(1<<0);} while(0)
#define GPIOB_REG_RST()         do{RCC->AHB1RSTR |= (1<<1);RCC->AHB1RSTR &= ~(1<<1);} while(0)
#define GPIOC_REG_RST()         do{RCC->AHB1RSTR |= (1<<2);RCC->AHB1RSTR &= ~(1<<2);} while(0)
#define GPIOD_REG_RST()         do{RCC->AHB1RSTR |= (1<<3);RCC->AHB1RSTR &= ~(1<<3);} while(0)
#define GPIOE_REG_RST()         do{RCC->AHB1RSTR |= (1<<4);RCC->AHB1RSTR &= ~(1<<4);} while(0)


// Configure pin
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnOrDis);

//Init and Denit
void GPIO_Init(GPIO_Handle_t *pGPIOHandel);
void GPIO_Init_Pin(GPIO_Handle_t *pGPIOHandel);
void GPIO_Denit(GPIO_RegDef_t *pGPIOx);

// Data read and write
uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIO, uint8_t GPIO_PinNumber);
uint16_t GPIO_ReadFromInpurPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteToOutPutPin(GPIO_RegDef_t *pGPIOx, uint8_t GPIO_PinNumber, uint8_t Status);
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint32_t Value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx,uint8_t GPIO_PinNumber);


#ifdef __cplusplus
}
#endif

#endif /* INC_STM32F411_GPIO_DRIVER_H_ */
